
export interface Flashcard {
  id: number;
  question: string;
  answer: string;
  isCorrect?: boolean;
}

export const flashcardsData: Flashcard[] = [
  {
    id: 1,
    question: "Самая длинная река мира",
    answer: "Амазонка"
  },
  {
    id: 2,
    question: "Самая высокая гора мира",
    answer: "Эверест (8848 м)"
  },
  {
    id: 3,
    question: "Самая большая пустыня",
    answer: "Сахара"
  },
  {
    id: 4,
    question: "Самый глубокий океан",
    answer: "Тихий океан"
  },
  {
    id: 5,
    question: "Столица Австралии",
    answer: "Канберра"
  },
  {
    id: 6,
    question: "Столица Канады",
    answer: "Оттава"
  },
  {
    id: 7,
    question: "Самая большая страна по площади",
    answer: "Россия"
  },
  {
    id: 8,
    question: "Самый маленький материк",
    answer: "Австралия"
  },
  {
    id: 9,
    question: "Какая река протекает через Египет?",
    answer: "Нил"
  },
  {
    id: 10,
    question: "Самый густонаселённый город мира",
    answer: "Токио"
  },
  {
    id: 11,
    question: "Страна с наибольшим количеством островов",
    answer: "Швеция"
  },
  {
    id: 12,
    question: "Где находится Великая китайская стена?",
    answer: "Китай"
  },
  {
    id: 13,
    question: "Самый большой океан мира",
    answer: "Тихий океан"
  },
  {
    id: 14,
    question: "Самая длинная горная система мира",
    answer: "Анды"
  },
  {
    id: 15,
    question: "Самое большое озеро в мире",
    answer: "Каспийское море"
  },
  {
    id: 16,
    question: "Самая высокая температура на Земле",
    answer: "+56,7 °C (Долина Смерти, США)"
  },
  {
    id: 17,
    question: "Что такое экватор?",
    answer: "Линия, делящая Землю на Северное и Южное полушария"
  },
  {
    id: 18,
    question: "Как называется нулевой меридиан?",
    answer: "Гринвичский меридиан"
  },
  {
    id: 19,
    question: "Какая страна занимает весь материк?",
    answer: "Австралия"
  },
  {
    id: 20,
    question: "Самый большой архипелаг мира",
    answer: "Малайский архипелаг"
  },
  {
    id: 21,
    question: "Сколько материков на Земле?",
    answer: "6 материков"
  },
  {
    id: 22,
    question: "Страна \"страна тысячи озёр\"",
    answer: "Финляндия"
  },
  {
    id: 23,
    question: "Где находятся Галапагосские острова?",
    answer: "Эквадор"
  },
  {
    id: 24,
    question: "Самая высокая гора в Африке",
    answer: "Килиманджаро"
  },
  {
    id: 25,
    question: "Как называется пояс тропических лесов вдоль экватора?",
    answer: "Амазонская сельва"
  },
  {
    id: 26,
    question: "Как называется научная карта Земли?",
    answer: "Топографическая карта"
  },
  {
    id: 27,
    question: "Что такое ледник?",
    answer: "Движущаяся масса льда"
  },
  {
    id: 28,
    question: "Какие океаны соединяет Панамский канал?",
    answer: "Атлантический и Тихий"
  },
  {
    id: 29,
    question: "Самая северная точка Земли",
    answer: "Северный полюс"
  },
  {
    id: 30,
    question: "Самый длинный канал в мире",
    answer: "Великий канал (Китай)"
  },
  {
    id: 31,
    question: "Столица Бразилии",
    answer: "Бразилиа"
  },
  {
    id: 32,
    question: "Самое солёное море",
    answer: "Красное море"
  },
  {
    id: 33,
    question: "В какой стране находится вулкан Этна?",
    answer: "Италия"
  },
  {
    id: 34,
    question: "Как называется часть земной коры, покрытая водой?",
    answer: "Океаническая кора"
  }
];
